MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAK176/mcu.h
extern volatile __IPC20bits_t IPC20bits __asm__ ("IPC20") __attribute__((section("sfrs"), address(0xBF810280)));
extern volatile uint32_t        IPC20CLR __attribute__((section("sfrs"),address(0xBF810284)));
extern volatile uint32_t        IPC20SET __attribute__((section("sfrs"),address(0xBF810288)));
extern volatile uint32_t        IPC20INV __attribute__((section("sfrs"),address(0xBF81028C)));
#define IPC21 IPC21
extern volatile uint32_t   IPC21 __attribute__((section("sfrs"), address(0xBF810290)));
typedef union {
  struct {
    uint32_t ADCD25IS:2;
    uint32_t ADCD25IP:3;
    uint32_t :3;
    uint32_t ADCD26IS:2;
    uint32_t ADCD26IP:3;
    uint32_t :3;
    uint32_t ADCD27IS:2;
    uint32_t ADCD27IP:3;
    uint32_t :3;
    uint32_t ADCD28IS:2;
    uint32_t ADCD28IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC21bits_t;
extern volatile __IPC21bits_t IPC21bits __asm__ ("IPC21") __attribute__((section("sfrs"), address(0xBF810290)));
extern volatile uint32_t        IPC21CLR __attribute__((section("sfrs"),address(0xBF810294)));
extern volatile uint32_t        IPC21SET __attribute__((section("sfrs"),address(0xBF810298)));
extern volatile uint32_t        IPC21INV __attribute__((section("sfrs"),address(0xBF81029C)));
#define IPC22 IPC22
extern volatile uint32_t   IPC22 __attribute__((section("sfrs"), address(0xBF8102A0)));
typedef union {
  struct {
    uint32_t ADCD29IS:2;
    uint32_t ADCD29IP:3;
    uint32_t :3;
    uint32_t ADCD30IS:2;
    uint32_t ADCD30IP:3;
    uint32_t :3;
    uint32_t ADCD31IS:2;
    uint32_t ADCD31IP:3;
    uint32_t :3;
    uint32_t ADCD32IS:2;
    uint32_t ADCD32IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC22bits_t;
extern volatile __IPC22bits_t IPC22bits __asm__ ("IPC22") __attribute__((section("sfrs"), address(0xBF8102A0)));
extern volatile uint32_t        IPC22CLR __attribute__((section("sfrs"),address(0xBF8102A4)));
extern volatile uint32_t        IPC22SET __attribute__((section("sfrs"),address(0xBF8102A8)));
extern volatile uint32_t        IPC22INV __attribute__((section("sfrs"),address(0xBF8102AC)));
#define IPC23 IPC23
extern volatile uint32_t   IPC23 __attribute__((section("sfrs"), address(0xBF8102B0)));
typedef union {
  struct {
    uint32_t ADCD33IS:2;
    uint32_t ADCD33IP:3;
    uint32_t :3;
    uint32_t ADCD34IS:2;
    uint32_t ADCD34IP:3;
    uint32_t :3;
    uint32_t ADCD35IS:2;
    uint32_t ADCD35IP:3;
    uint32_t :3;
    uint32_t ADCD36IS:2;
    uint32_t ADCD36IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC23bits_t;
extern volatile __IPC23bits_t IPC23bits __asm__ ("IPC23") __attribute__((section("sfrs"), address(0xBF8102B0)));
extern volatile uint32_t        IPC23CLR __attribute__((section("sfrs"),address(0xBF8102B4)));
extern volatile uint32_t        IPC23SET __attribute__((section("sfrs"),address(0xBF8102B8)));
extern volatile uint32_t        IPC23INV __attribute__((section("sfrs"),address(0xBF8102BC)));
#define IPC24 IPC24
extern volatile uint32_t   IPC24 __attribute__((section("sfrs"), address(0xBF8102C0)));
typedef union {
  struct {
    uint32_t ADCD37IS:2;
    uint32_t ADCD37IP:3;
    uint32_t :3;
    uint32_t ADCD38IS:2;
    uint32_t ADCD38IP:3;
    uint32_t :3;
    uint32_t ADCD39IS:2;
    uint32_t ADCD39IP:3;
    uint32_t :3;
    uint32_t ADCD40IS:2;
    uint32_t ADCD40IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC24bits_t;
extern volatile __IPC24bits_t IPC24bits __asm__ ("IPC24") __attribute__((section("sfrs"), address(0xBF8102C0)));
extern volatile uint32_t        IPC24CLR __attribute__((section("sfrs"),address(0xBF8102C4)));
extern volatile uint32_t        IPC24SET __attribute__((section("sfrs"),address(0xBF8102C8)));
extern volatile uint32_t        IPC24INV __attribute__((section("sfrs"),address(0xBF8102CC)));
#define IPC25 IPC25
extern volatile uint32_t   IPC25 __attribute__((section("sfrs"), address(0xBF8102D0)));
typedef union {
  struct {
    uint32_t ADCD41IS:2;
    uint32_t ADCD41IP:3;
    uint32_t :3;
    uint32_t ADCD42IS:2;
    uint32_t ADCD42IP:3;
    uint32_t :3;
    uint32_t ADCD43IS:2;
    uint32_t ADCD43IP:3;
    uint32_t :3;
    uint32_t USBSRIS:2;
    uint32_t USBSRIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC25bits_t;
extern volatile __IPC25bits_t IPC25bits __asm__ ("IPC25") __attribute__((section("sfrs"), address(0xBF8102D0)));
extern volatile uint32_t        IPC25CLR __attribute__((section("sfrs"),address(0xBF8102D4)));
extern volatile uint32_t        IPC25SET __attribute__((section("sfrs"),address(0xBF8102D8)));
extern volatile uint32_t        IPC25INV __attribute__((section("sfrs"),address(0xBF8102DC)));
#define IPC26 IPC26
extern volatile uint32_t   IPC26 __attribute__((section("sfrs"), address(0xBF8102E0)));
typedef union {
  struct {
    uint32_t CPCIS:2;
    uint32_t CPCIP:3;
    uint32_t :3;
    uint32_t CFDCIS:2;
    uint32_t CFDCIP:3;
    uint32_t :3;
    uint32_t SBIS:2;
    uint32_t SBIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC26bits_t;
extern volatile __IPC26bits_t IPC26bits __asm__ ("IPC26") __attribute__((section("sfrs"), address(0xBF8102E0)));
extern volatile uint32_t        IPC26CLR __attribute__((section("sfrs"),address(0xBF8102E4)));
extern volatile uint32_t        IPC26SET __attribute__((section("sfrs"),address(0xBF8102E8)));
extern volatile uint32_t        IPC26INV __attribute__((section("sfrs"),address(0xBF8102EC)));
#define IPC27 IPC27
extern volatile uint32_t   IPC27 __attribute__((section("sfrs"), address(0xBF8102F0)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t SPI1EIS:2;
    uint32_t SPI1EIP:3;
    uint32_t :3;
    uint32_t SPI1RXIS:2;
    uint32_t SPI1RXIP:3;
    uint32_t :3;
    uint32_t SPI1TXIS:2;
    uint32_t SPI1TXIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC27bits_t;
extern volatile __IPC27bits_t IPC27bits __asm__ ("IPC27") __attribute__((section("sfrs"), address(0xBF8102F0)));
extern volatile uint32_t        IPC27CLR __attribute__((section("sfrs"),address(0xBF8102F4)));
extern volatile uint32_t        IPC27SET __attribute__((section("sfrs"),address(0xBF8102F8)));
extern volatile uint32_t        IPC27INV __attribute__((section("sfrs"),address(0xBF8102FC)));
#define IPC28 IPC28
extern volatile uint32_t   IPC28 __attribute__((section("sfrs"), address(0xBF810300)));
typedef union {
  struct {
    uint32_t U1EIS:2;
    uint32_t U1EIP:3;
    uint32_t :3;
    uint32_t U1RXIS:2;
    uint32_t U1RXIP:3;
    uint32_t :3;
    uint32_t U1TXIS:2;
    uint32_t U1TXIP:3;
    uint32_t :3;
    uint32_t I2C1BIS:2;
    uint32_t I2C1BIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC28bits_t;
extern volatile __IPC28bits_t IPC28bits __asm__ ("IPC28") __attribute__((section("sfrs"), address(0xBF810300)));
extern volatile uint32_t        IPC28CLR __attribute__((section("sfrs"),address(0xBF810304)));
extern volatile uint32_t        IPC28SET __attribute__((section("sfrs"),address(0xBF810308)));
extern volatile uint32_t        IPC28INV __attribute__((section("sfrs"),address(0xBF81030C)));
#define IPC29 IPC29
extern volatile uint32_t   IPC29 __attribute__((section("sfrs"), address(0xBF810310)));
typedef union {
  struct {
    uint32_t I2C1SIS:2;
    uint32_t I2C1SIP:3;
    uint32_t :3;
    uint32_t I2C1MIS:2;
    uint32_t I2C1MIP:3;
    uint32_t :3;
    uint32_t CNAIS:2;
    uint32_t CNAIP:3;
    uint32_t :3;
    uint32_t CNBIS:2;
    uint32_t CNBIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC29bits_t;
extern volatile __IPC29bits_t IPC29bits __asm__ ("IPC29") __attribute__((section("sfrs"), address(0xBF810310)));
extern volatile uint32_t        IPC29CLR __attribute__((section("sfrs"),address(0xBF810314)));
extern volatile uint32_t        IPC29SET __attribute__((section("sfrs"),address(0xBF810318)));
extern volatile uint32_t        IPC29INV __attribute__((section("sfrs"),address(0xBF81031C)));
#define IPC30 IPC30
extern volatile uint32_t   IPC30 __attribute__((section("sfrs"), address(0xBF810320)));
typedef union {
  struct {
    uint32_t CNCIS:2;
    uint32_t CNCIP:3;
    uint32_t :3;
    uint32_t CNDIS:2;
    uint32_t CNDIP:3;
    uint32_t :3;
    uint32_t CNEIS:2;
    uint32_t CNEIP:3;
    uint32_t :3;
    uint32_t CNFIS:2;
    uint32_t CNFIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC30bits_t;
