MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAK176/mcu.h
extern volatile __GLCDL0MODEbits_t GLCDL0MODEbits __asm__ ("GLCDL0MODE") __attribute__((section("sfrs"), address(0xBF8EA030)));
#define GLCDL0START GLCDL0START
extern volatile uint32_t   GLCDL0START __attribute__((section("sfrs"), address(0xBF8EA034)));
typedef struct {
  uint32_t STARTY:11;
  uint32_t :5;
  uint32_t STARTX:11;
} __GLCDL0STARTbits_t;
extern volatile __GLCDL0STARTbits_t GLCDL0STARTbits __asm__ ("GLCDL0START") __attribute__((section("sfrs"), address(0xBF8EA034)));
#define GLCDL0SIZE GLCDL0SIZE
extern volatile uint32_t   GLCDL0SIZE __attribute__((section("sfrs"), address(0xBF8EA038)));
typedef struct {
  uint32_t SIZEY:11;
  uint32_t :5;
  uint32_t SIZEX:11;
} __GLCDL0SIZEbits_t;
extern volatile __GLCDL0SIZEbits_t GLCDL0SIZEbits __asm__ ("GLCDL0SIZE") __attribute__((section("sfrs"), address(0xBF8EA038)));
#define GLCDL0BADDR GLCDL0BADDR
extern volatile uint32_t   GLCDL0BADDR __attribute__((section("sfrs"), address(0xBF8EA03C)));
typedef struct {
  uint32_t BASEADDR:32;
} __GLCDL0BADDRbits_t;
extern volatile __GLCDL0BADDRbits_t GLCDL0BADDRbits __asm__ ("GLCDL0BADDR") __attribute__((section("sfrs"), address(0xBF8EA03C)));
#define GLCDL0STRIDE GLCDL0STRIDE
extern volatile uint32_t   GLCDL0STRIDE __attribute__((section("sfrs"), address(0xBF8EA040)));
typedef struct {
  uint32_t STRIDE:16;
} __GLCDL0STRIDEbits_t;
extern volatile __GLCDL0STRIDEbits_t GLCDL0STRIDEbits __asm__ ("GLCDL0STRIDE") __attribute__((section("sfrs"), address(0xBF8EA040)));
#define GLCDL0RES GLCDL0RES
extern volatile uint32_t   GLCDL0RES __attribute__((section("sfrs"), address(0xBF8EA044)));
typedef struct {
  uint32_t RESY:11;
  uint32_t :5;
  uint32_t RESX:11;
} __GLCDL0RESbits_t;
extern volatile __GLCDL0RESbits_t GLCDL0RESbits __asm__ ("GLCDL0RES") __attribute__((section("sfrs"), address(0xBF8EA044)));
#define GLCDL1MODE GLCDL1MODE
extern volatile uint32_t   GLCDL1MODE __attribute__((section("sfrs"), address(0xBF8EA050)));
typedef struct {
  uint32_t COLORMODE:4;
  uint32_t :4;
  uint32_t SRCBLEND:4;
  uint32_t DESTBLEND:4;
  uint32_t ALPHA:8;
  uint32_t :4;
  uint32_t MULALPHA:1;
  uint32_t FORCEALPHA:1;
  uint32_t DISABIFIL:1;
  uint32_t LAYEREN:1;
} __GLCDL1MODEbits_t;
extern volatile __GLCDL1MODEbits_t GLCDL1MODEbits __asm__ ("GLCDL1MODE") __attribute__((section("sfrs"), address(0xBF8EA050)));
#define GLCDL1START GLCDL1START
extern volatile uint32_t   GLCDL1START __attribute__((section("sfrs"), address(0xBF8EA054)));
typedef struct {
  uint32_t STARTY:11;
  uint32_t :5;
  uint32_t STARTX:11;
} __GLCDL1STARTbits_t;
extern volatile __GLCDL1STARTbits_t GLCDL1STARTbits __asm__ ("GLCDL1START") __attribute__((section("sfrs"), address(0xBF8EA054)));
#define GLCDL1SIZE GLCDL1SIZE
extern volatile uint32_t   GLCDL1SIZE __attribute__((section("sfrs"), address(0xBF8EA058)));
typedef struct {
  uint32_t SIZEY:11;
  uint32_t :5;
  uint32_t SIZEX:11;
} __GLCDL1SIZEbits_t;
extern volatile __GLCDL1SIZEbits_t GLCDL1SIZEbits __asm__ ("GLCDL1SIZE") __attribute__((section("sfrs"), address(0xBF8EA058)));
#define GLCDL1BADDR GLCDL1BADDR
extern volatile uint32_t   GLCDL1BADDR __attribute__((section("sfrs"), address(0xBF8EA05C)));
typedef struct {
  uint32_t BASEADDR:32;
} __GLCDL1BADDRbits_t;
extern volatile __GLCDL1BADDRbits_t GLCDL1BADDRbits __asm__ ("GLCDL1BADDR") __attribute__((section("sfrs"), address(0xBF8EA05C)));
#define GLCDL1STRIDE GLCDL1STRIDE
extern volatile uint32_t   GLCDL1STRIDE __attribute__((section("sfrs"), address(0xBF8EA060)));
typedef struct {
  uint32_t STRIDE:16;
} __GLCDL1STRIDEbits_t;
extern volatile __GLCDL1STRIDEbits_t GLCDL1STRIDEbits __asm__ ("GLCDL1STRIDE") __attribute__((section("sfrs"), address(0xBF8EA060)));
#define GLCDL1RES GLCDL1RES
extern volatile uint32_t   GLCDL1RES __attribute__((section("sfrs"), address(0xBF8EA064)));
typedef struct {
  uint32_t RESY:11;
  uint32_t :5;
  uint32_t RESX:11;
} __GLCDL1RESbits_t;
extern volatile __GLCDL1RESbits_t GLCDL1RESbits __asm__ ("GLCDL1RES") __attribute__((section("sfrs"), address(0xBF8EA064)));
#define GLCDL2MODE GLCDL2MODE
extern volatile uint32_t   GLCDL2MODE __attribute__((section("sfrs"), address(0xBF8EA070)));
typedef struct {
  uint32_t COLORMODE:4;
  uint32_t :4;
  uint32_t SRCBLEND:4;
  uint32_t DESTBLEND:4;
  uint32_t ALPHA:8;
  uint32_t :4;
  uint32_t MULALPHA:1;
  uint32_t FORCEALPHA:1;
  uint32_t DISABIFIL:1;
  uint32_t LAYEREN:1;
} __GLCDL2MODEbits_t;
extern volatile __GLCDL2MODEbits_t GLCDL2MODEbits __asm__ ("GLCDL2MODE") __attribute__((section("sfrs"), address(0xBF8EA070)));
#define GLCDL2START GLCDL2START
extern volatile uint32_t   GLCDL2START __attribute__((section("sfrs"), address(0xBF8EA074)));
typedef struct {
  uint32_t STARTY:11;
  uint32_t :5;
  uint32_t STARTX:11;
} __GLCDL2STARTbits_t;
extern volatile __GLCDL2STARTbits_t GLCDL2STARTbits __asm__ ("GLCDL2START") __attribute__((section("sfrs"), address(0xBF8EA074)));
#define GLCDL2SIZE GLCDL2SIZE
extern volatile uint32_t   GLCDL2SIZE __attribute__((section("sfrs"), address(0xBF8EA078)));
typedef struct {
  uint32_t SIZEY:11;
  uint32_t :5;
  uint32_t SIZEX:11;
} __GLCDL2SIZEbits_t;
extern volatile __GLCDL2SIZEbits_t GLCDL2SIZEbits __asm__ ("GLCDL2SIZE") __attribute__((section("sfrs"), address(0xBF8EA078)));
#define GLCDL2BADDR GLCDL2BADDR
extern volatile uint32_t   GLCDL2BADDR __attribute__((section("sfrs"), address(0xBF8EA07C)));
typedef struct {
  uint32_t BASEADDR:32;
} __GLCDL2BADDRbits_t;
extern volatile __GLCDL2BADDRbits_t GLCDL2BADDRbits __asm__ ("GLCDL2BADDR") __attribute__((section("sfrs"), address(0xBF8EA07C)));
#define GLCDL2STRIDE GLCDL2STRIDE
extern volatile uint32_t   GLCDL2STRIDE __attribute__((section("sfrs"), address(0xBF8EA080)));
typedef struct {
  uint32_t STRIDE:16;
} __GLCDL2STRIDEbits_t;
extern volatile __GLCDL2STRIDEbits_t GLCDL2STRIDEbits __asm__ ("GLCDL2STRIDE") __attribute__((section("sfrs"), address(0xBF8EA080)));
#define GLCDL2RES GLCDL2RES
extern volatile uint32_t   GLCDL2RES __attribute__((section("sfrs"), address(0xBF8EA084)));
typedef struct {
  uint32_t RESY:11;
  uint32_t :5;
  uint32_t RESX:11;
} __GLCDL2RESbits_t;
extern volatile __GLCDL2RESbits_t GLCDL2RESbits __asm__ ("GLCDL2RES") __attribute__((section("sfrs"), address(0xBF8EA084)));
#define GLCDINT GLCDINT
extern volatile uint32_t   GLCDINT __attribute__((section("sfrs"), address(0xBF8EA0F8)));
typedef struct {
  uint32_t VSYNCINT:1;
  uint32_t HSYNCINT:1;
  uint32_t :29;
  uint32_t IRQCON:1;
} __GLCDINTbits_t;
extern volatile __GLCDINTbits_t GLCDINTbits __asm__ ("GLCDINT") __attribute__((section("sfrs"), address(0xBF8EA0F8)));
#define GLCDSTAT GLCDSTAT
extern volatile uint32_t   GLCDSTAT __attribute__((section("sfrs"), address(0xBF8EA0FC)));
typedef struct {
  uint32_t ACTIVE:1;
  uint32_t DE:1;
  uint32_t HSYNC:1;
  uint32_t VSYNC:1;
  uint32_t :1;
  uint32_t LROW:1;
} __GLCDSTATbits_t;
extern volatile __GLCDSTATbits_t GLCDSTATbits __asm__ ("GLCDSTAT") __attribute__((section("sfrs"), address(0xBF8EA0FC)));
#define GLCDCLUT0 GLCDCLUT0
extern volatile uint32_t   GLCDCLUT0 __attribute__((section("sfrs"), address(0xBF8EA400)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT0bits_t;
