MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAK176/mcu.h
#define _IEC1_ADCD2IE_POSITION                   0x0000001D
#define _IEC1_ADCD2IE_MASK                       0x20000000
#define _IEC1_ADCD2IE_LENGTH                     0x00000001

#define _IEC1_ADCD3IE_POSITION                   0x0000001E
#define _IEC1_ADCD3IE_MASK                       0x40000000
#define _IEC1_ADCD3IE_LENGTH                     0x00000001

#define _IEC1_ADCD4IE_POSITION                   0x0000001F
#define _IEC1_ADCD4IE_MASK                       0x80000000
#define _IEC1_ADCD4IE_LENGTH                     0x00000001

#define _IEC1_w_POSITION                         0x00000000
#define _IEC1_w_MASK                             0xFFFFFFFF
#define _IEC1_w_LENGTH                           0x00000020

#define _IEC2_ADCD5IE_POSITION                   0x00000000
#define _IEC2_ADCD5IE_MASK                       0x00000001
#define _IEC2_ADCD5IE_LENGTH                     0x00000001

#define _IEC2_ADCD6IE_POSITION                   0x00000001
#define _IEC2_ADCD6IE_MASK                       0x00000002
#define _IEC2_ADCD6IE_LENGTH                     0x00000001

#define _IEC2_ADCD7IE_POSITION                   0x00000002
#define _IEC2_ADCD7IE_MASK                       0x00000004
#define _IEC2_ADCD7IE_LENGTH                     0x00000001

#define _IEC2_ADCD8IE_POSITION                   0x00000003
#define _IEC2_ADCD8IE_MASK                       0x00000008
#define _IEC2_ADCD8IE_LENGTH                     0x00000001

#define _IEC2_ADCD9IE_POSITION                   0x00000004
#define _IEC2_ADCD9IE_MASK                       0x00000010
#define _IEC2_ADCD9IE_LENGTH                     0x00000001

#define _IEC2_ADCD10IE_POSITION                  0x00000005
#define _IEC2_ADCD10IE_MASK                      0x00000020
#define _IEC2_ADCD10IE_LENGTH                    0x00000001

#define _IEC2_ADCD11IE_POSITION                  0x00000006
#define _IEC2_ADCD11IE_MASK                      0x00000040
#define _IEC2_ADCD11IE_LENGTH                    0x00000001

#define _IEC2_ADCD12IE_POSITION                  0x00000007
#define _IEC2_ADCD12IE_MASK                      0x00000080
#define _IEC2_ADCD12IE_LENGTH                    0x00000001

#define _IEC2_ADCD13IE_POSITION                  0x00000008
#define _IEC2_ADCD13IE_MASK                      0x00000100
#define _IEC2_ADCD13IE_LENGTH                    0x00000001

#define _IEC2_ADCD14IE_POSITION                  0x00000009
#define _IEC2_ADCD14IE_MASK                      0x00000200
#define _IEC2_ADCD14IE_LENGTH                    0x00000001

#define _IEC2_ADCD15IE_POSITION                  0x0000000A
#define _IEC2_ADCD15IE_MASK                      0x00000400
#define _IEC2_ADCD15IE_LENGTH                    0x00000001

#define _IEC2_ADCD16IE_POSITION                  0x0000000B
#define _IEC2_ADCD16IE_MASK                      0x00000800
#define _IEC2_ADCD16IE_LENGTH                    0x00000001

#define _IEC2_ADCD17IE_POSITION                  0x0000000C
#define _IEC2_ADCD17IE_MASK                      0x00001000
#define _IEC2_ADCD17IE_LENGTH                    0x00000001

#define _IEC2_ADCD18IE_POSITION                  0x0000000D
#define _IEC2_ADCD18IE_MASK                      0x00002000
#define _IEC2_ADCD18IE_LENGTH                    0x00000001

#define _IEC2_ADCD19IE_POSITION                  0x0000000E
#define _IEC2_ADCD19IE_MASK                      0x00004000
#define _IEC2_ADCD19IE_LENGTH                    0x00000001

#define _IEC2_ADCD20IE_POSITION                  0x0000000F
#define _IEC2_ADCD20IE_MASK                      0x00008000
#define _IEC2_ADCD20IE_LENGTH                    0x00000001

#define _IEC2_ADCD21IE_POSITION                  0x00000010
#define _IEC2_ADCD21IE_MASK                      0x00010000
#define _IEC2_ADCD21IE_LENGTH                    0x00000001

#define _IEC2_ADCD22IE_POSITION                  0x00000011
#define _IEC2_ADCD22IE_MASK                      0x00020000
#define _IEC2_ADCD22IE_LENGTH                    0x00000001

#define _IEC2_ADCD23IE_POSITION                  0x00000012
#define _IEC2_ADCD23IE_MASK                      0x00040000
#define _IEC2_ADCD23IE_LENGTH                    0x00000001

#define _IEC2_ADCD24IE_POSITION                  0x00000013
#define _IEC2_ADCD24IE_MASK                      0x00080000
#define _IEC2_ADCD24IE_LENGTH                    0x00000001

#define _IEC2_ADCD25IE_POSITION                  0x00000014
#define _IEC2_ADCD25IE_MASK                      0x00100000
#define _IEC2_ADCD25IE_LENGTH                    0x00000001

#define _IEC2_ADCD26IE_POSITION                  0x00000015
#define _IEC2_ADCD26IE_MASK                      0x00200000
#define _IEC2_ADCD26IE_LENGTH                    0x00000001

#define _IEC2_ADCD27IE_POSITION                  0x00000016
#define _IEC2_ADCD27IE_MASK                      0x00400000
#define _IEC2_ADCD27IE_LENGTH                    0x00000001

#define _IEC2_ADCD28IE_POSITION                  0x00000017
#define _IEC2_ADCD28IE_MASK                      0x00800000
#define _IEC2_ADCD28IE_LENGTH                    0x00000001

#define _IEC2_ADCD29IE_POSITION                  0x00000018
#define _IEC2_ADCD29IE_MASK                      0x01000000
#define _IEC2_ADCD29IE_LENGTH                    0x00000001

#define _IEC2_ADCD30IE_POSITION                  0x00000019
#define _IEC2_ADCD30IE_MASK                      0x02000000
#define _IEC2_ADCD30IE_LENGTH                    0x00000001

#define _IEC2_ADCD31IE_POSITION                  0x0000001A
#define _IEC2_ADCD31IE_MASK                      0x04000000
#define _IEC2_ADCD31IE_LENGTH                    0x00000001

#define _IEC2_ADCD32IE_POSITION                  0x0000001B
#define _IEC2_ADCD32IE_MASK                      0x08000000
#define _IEC2_ADCD32IE_LENGTH                    0x00000001

#define _IEC2_ADCD33IE_POSITION                  0x0000001C
#define _IEC2_ADCD33IE_MASK                      0x10000000
#define _IEC2_ADCD33IE_LENGTH                    0x00000001

#define _IEC2_ADCD34IE_POSITION                  0x0000001D
#define _IEC2_ADCD34IE_MASK                      0x20000000
#define _IEC2_ADCD34IE_LENGTH                    0x00000001

#define _IEC2_ADCD35IE_POSITION                  0x0000001E
#define _IEC2_ADCD35IE_MASK                      0x40000000
#define _IEC2_ADCD35IE_LENGTH                    0x00000001

#define _IEC2_ADCD36IE_POSITION                  0x0000001F
#define _IEC2_ADCD36IE_MASK                      0x80000000
#define _IEC2_ADCD36IE_LENGTH                    0x00000001

