MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAK176/mcu.h
#define _IPC44_U5EIS_POSITION                    0x00000018
#define _IPC44_U5EIS_MASK                        0x03000000
#define _IPC44_U5EIS_LENGTH                      0x00000002

#define _IPC44_U5EIP_POSITION                    0x0000001A
#define _IPC44_U5EIP_MASK                        0x1C000000
#define _IPC44_U5EIP_LENGTH                      0x00000003

#define _IPC44_w_POSITION                        0x00000000
#define _IPC44_w_MASK                            0xFFFFFFFF
#define _IPC44_w_LENGTH                          0x00000020

#define _IPC45_U5RXIS_POSITION                   0x00000000
#define _IPC45_U5RXIS_MASK                       0x00000003
#define _IPC45_U5RXIS_LENGTH                     0x00000002

#define _IPC45_U5RXIP_POSITION                   0x00000002
#define _IPC45_U5RXIP_MASK                       0x0000001C
#define _IPC45_U5RXIP_LENGTH                     0x00000003

#define _IPC45_U5TXIS_POSITION                   0x00000008
#define _IPC45_U5TXIS_MASK                       0x00000300
#define _IPC45_U5TXIS_LENGTH                     0x00000002

#define _IPC45_U5TXIP_POSITION                   0x0000000A
#define _IPC45_U5TXIP_MASK                       0x00001C00
#define _IPC45_U5TXIP_LENGTH                     0x00000003

#define _IPC45_I2C5BIS_POSITION                  0x00000010
#define _IPC45_I2C5BIS_MASK                      0x00030000
#define _IPC45_I2C5BIS_LENGTH                    0x00000002

#define _IPC45_I2C5BIP_POSITION                  0x00000012
#define _IPC45_I2C5BIP_MASK                      0x001C0000
#define _IPC45_I2C5BIP_LENGTH                    0x00000003

#define _IPC45_I2C5SIS_POSITION                  0x00000018
#define _IPC45_I2C5SIS_MASK                      0x03000000
#define _IPC45_I2C5SIS_LENGTH                    0x00000002

#define _IPC45_I2C5SIP_POSITION                  0x0000001A
#define _IPC45_I2C5SIP_MASK                      0x1C000000
#define _IPC45_I2C5SIP_LENGTH                    0x00000003

#define _IPC45_w_POSITION                        0x00000000
#define _IPC45_w_MASK                            0xFFFFFFFF
#define _IPC45_w_LENGTH                          0x00000020

#define _IPC46_I2C5MIS_POSITION                  0x00000000
#define _IPC46_I2C5MIS_MASK                      0x00000003
#define _IPC46_I2C5MIS_LENGTH                    0x00000002

#define _IPC46_I2C5MIP_POSITION                  0x00000002
#define _IPC46_I2C5MIP_MASK                      0x0000001C
#define _IPC46_I2C5MIP_LENGTH                    0x00000003

#define _IPC46_SPI6EIS_POSITION                  0x00000008
#define _IPC46_SPI6EIS_MASK                      0x00000300
#define _IPC46_SPI6EIS_LENGTH                    0x00000002

#define _IPC46_SPI6EIP_POSITION                  0x0000000A
#define _IPC46_SPI6EIP_MASK                      0x00001C00
#define _IPC46_SPI6EIP_LENGTH                    0x00000003

#define _IPC46_SPI6RXIS_POSITION                 0x00000010
#define _IPC46_SPI6RXIS_MASK                     0x00030000
#define _IPC46_SPI6RXIS_LENGTH                   0x00000002

#define _IPC46_SPI6RXIP_POSITION                 0x00000012
#define _IPC46_SPI6RXIP_MASK                     0x001C0000
#define _IPC46_SPI6RXIP_LENGTH                   0x00000003

#define _IPC46_SPI6TXIS_POSITION                 0x00000018
#define _IPC46_SPI6TXIS_MASK                     0x03000000
#define _IPC46_SPI6TXIS_LENGTH                   0x00000002

#define _IPC46_SPI6TXIP_POSITION                 0x0000001A
#define _IPC46_SPI6TXIP_MASK                     0x1C000000
#define _IPC46_SPI6TXIP_LENGTH                   0x00000003

#define _IPC46_w_POSITION                        0x00000000
#define _IPC46_w_MASK                            0xFFFFFFFF
#define _IPC46_w_LENGTH                          0x00000020

#define _IPC47_U6EIS_POSITION                    0x00000000
#define _IPC47_U6EIS_MASK                        0x00000003
#define _IPC47_U6EIS_LENGTH                      0x00000002

#define _IPC47_U6EIP_POSITION                    0x00000002
#define _IPC47_U6EIP_MASK                        0x0000001C
#define _IPC47_U6EIP_LENGTH                      0x00000003

#define _IPC47_U6RXIS_POSITION                   0x00000008
#define _IPC47_U6RXIS_MASK                       0x00000300
#define _IPC47_U6RXIS_LENGTH                     0x00000002

#define _IPC47_U6RXIP_POSITION                   0x0000000A
#define _IPC47_U6RXIP_MASK                       0x00001C00
#define _IPC47_U6RXIP_LENGTH                     0x00000003

#define _IPC47_U6TXIS_POSITION                   0x00000010
#define _IPC47_U6TXIS_MASK                       0x00030000
#define _IPC47_U6TXIS_LENGTH                     0x00000002

#define _IPC47_U6TXIP_POSITION                   0x00000012
#define _IPC47_U6TXIP_MASK                       0x001C0000
#define _IPC47_U6TXIP_LENGTH                     0x00000003

#define _IPC47_SDHCIS_POSITION                   0x00000018
#define _IPC47_SDHCIS_MASK                       0x03000000
#define _IPC47_SDHCIS_LENGTH                     0x00000002

#define _IPC47_SDHCIP_POSITION                   0x0000001A
#define _IPC47_SDHCIP_MASK                       0x1C000000
#define _IPC47_SDHCIP_LENGTH                     0x00000003

#define _IPC47_w_POSITION                        0x00000000
#define _IPC47_w_MASK                            0xFFFFFFFF
#define _IPC47_w_LENGTH                          0x00000020

#define _IPC48_GLCDIS_POSITION                   0x00000000
#define _IPC48_GLCDIS_MASK                       0x00000003
#define _IPC48_GLCDIS_LENGTH                     0x00000002

#define _IPC48_GLCDIP_POSITION                   0x00000002
#define _IPC48_GLCDIP_MASK                       0x0000001C
#define _IPC48_GLCDIP_LENGTH                     0x00000003

#define _IPC48_GPUIS_POSITION                    0x00000008
#define _IPC48_GPUIS_MASK                        0x00000300
#define _IPC48_GPUIS_LENGTH                      0x00000002

#define _IPC48_GPUIP_POSITION                    0x0000000A
#define _IPC48_GPUIP_MASK                        0x00001C00
#define _IPC48_GPUIP_LENGTH                      0x00000003

#define _IPC48_CTMUIS_POSITION                   0x00000018
#define _IPC48_CTMUIS_MASK                       0x03000000
#define _IPC48_CTMUIS_LENGTH                     0x00000002

#define _IPC48_CTMUIP_POSITION                   0x0000001A
#define _IPC48_CTMUIP_MASK                       0x1C000000
#define _IPC48_CTMUIP_LENGTH                     0x00000003

