MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAK176/mcu.h
#define _GLCDCURDATA105_PIXEL269_POSITION        0x00000018
#define _GLCDCURDATA105_PIXEL269_MASK            0x0F000000
#define _GLCDCURDATA105_PIXEL269_LENGTH          0x00000004

#define _GLCDCURDATA105_PIXEL268_POSITION        0x0000001C
#define _GLCDCURDATA105_PIXEL268_MASK            0xF0000000
#define _GLCDCURDATA105_PIXEL268_LENGTH          0x00000004

#define _GLCDCURDATA106_PIXEL2623_POSITION       0x00000000
#define _GLCDCURDATA106_PIXEL2623_MASK           0x0000000F
#define _GLCDCURDATA106_PIXEL2623_LENGTH         0x00000004

#define _GLCDCURDATA106_PIXEL2622_POSITION       0x00000004
#define _GLCDCURDATA106_PIXEL2622_MASK           0x000000F0
#define _GLCDCURDATA106_PIXEL2622_LENGTH         0x00000004

#define _GLCDCURDATA106_PIXEL2621_POSITION       0x00000008
#define _GLCDCURDATA106_PIXEL2621_MASK           0x00000F00
#define _GLCDCURDATA106_PIXEL2621_LENGTH         0x00000004

#define _GLCDCURDATA106_PIXEL2620_POSITION       0x0000000C
#define _GLCDCURDATA106_PIXEL2620_MASK           0x0000F000
#define _GLCDCURDATA106_PIXEL2620_LENGTH         0x00000004

#define _GLCDCURDATA106_PIXEL2619_POSITION       0x00000010
#define _GLCDCURDATA106_PIXEL2619_MASK           0x000F0000
#define _GLCDCURDATA106_PIXEL2619_LENGTH         0x00000004

#define _GLCDCURDATA106_PIXEL2618_POSITION       0x00000014
#define _GLCDCURDATA106_PIXEL2618_MASK           0x00F00000
#define _GLCDCURDATA106_PIXEL2618_LENGTH         0x00000004

#define _GLCDCURDATA106_PIXEL2617_POSITION       0x00000018
#define _GLCDCURDATA106_PIXEL2617_MASK           0x0F000000
#define _GLCDCURDATA106_PIXEL2617_LENGTH         0x00000004

#define _GLCDCURDATA106_PIXEL2616_POSITION       0x0000001C
#define _GLCDCURDATA106_PIXEL2616_MASK           0xF0000000
#define _GLCDCURDATA106_PIXEL2616_LENGTH         0x00000004

#define _GLCDCURDATA107_PIXEL2631_POSITION       0x00000000
#define _GLCDCURDATA107_PIXEL2631_MASK           0x0000000F
#define _GLCDCURDATA107_PIXEL2631_LENGTH         0x00000004

#define _GLCDCURDATA107_PIXEL2630_POSITION       0x00000004
#define _GLCDCURDATA107_PIXEL2630_MASK           0x000000F0
#define _GLCDCURDATA107_PIXEL2630_LENGTH         0x00000004

#define _GLCDCURDATA107_PIXEL2629_POSITION       0x00000008
#define _GLCDCURDATA107_PIXEL2629_MASK           0x00000F00
#define _GLCDCURDATA107_PIXEL2629_LENGTH         0x00000004

#define _GLCDCURDATA107_PIXEL2628_POSITION       0x0000000C
#define _GLCDCURDATA107_PIXEL2628_MASK           0x0000F000
#define _GLCDCURDATA107_PIXEL2628_LENGTH         0x00000004

#define _GLCDCURDATA107_PIXEL2627_POSITION       0x00000010
#define _GLCDCURDATA107_PIXEL2627_MASK           0x000F0000
#define _GLCDCURDATA107_PIXEL2627_LENGTH         0x00000004

#define _GLCDCURDATA107_PIXEL2626_POSITION       0x00000014
#define _GLCDCURDATA107_PIXEL2626_MASK           0x00F00000
#define _GLCDCURDATA107_PIXEL2626_LENGTH         0x00000004

#define _GLCDCURDATA107_PIXEL2625_POSITION       0x00000018
#define _GLCDCURDATA107_PIXEL2625_MASK           0x0F000000
#define _GLCDCURDATA107_PIXEL2625_LENGTH         0x00000004

#define _GLCDCURDATA107_PIXEL2624_POSITION       0x0000001C
#define _GLCDCURDATA107_PIXEL2624_MASK           0xF0000000
#define _GLCDCURDATA107_PIXEL2624_LENGTH         0x00000004

#define _GLCDCURDATA108_PIXEL277_POSITION        0x00000000
#define _GLCDCURDATA108_PIXEL277_MASK            0x0000000F
#define _GLCDCURDATA108_PIXEL277_LENGTH          0x00000004

#define _GLCDCURDATA108_PIXEL276_POSITION        0x00000004
#define _GLCDCURDATA108_PIXEL276_MASK            0x000000F0
#define _GLCDCURDATA108_PIXEL276_LENGTH          0x00000004

#define _GLCDCURDATA108_PIXEL275_POSITION        0x00000008
#define _GLCDCURDATA108_PIXEL275_MASK            0x00000F00
#define _GLCDCURDATA108_PIXEL275_LENGTH          0x00000004

#define _GLCDCURDATA108_PIXEL274_POSITION        0x0000000C
#define _GLCDCURDATA108_PIXEL274_MASK            0x0000F000
#define _GLCDCURDATA108_PIXEL274_LENGTH          0x00000004

#define _GLCDCURDATA108_PIXEL273_POSITION        0x00000010
#define _GLCDCURDATA108_PIXEL273_MASK            0x000F0000
#define _GLCDCURDATA108_PIXEL273_LENGTH          0x00000004

#define _GLCDCURDATA108_PIXEL272_POSITION        0x00000014
#define _GLCDCURDATA108_PIXEL272_MASK            0x00F00000
#define _GLCDCURDATA108_PIXEL272_LENGTH          0x00000004

#define _GLCDCURDATA108_PIXEL271_POSITION        0x00000018
#define _GLCDCURDATA108_PIXEL271_MASK            0x0F000000
#define _GLCDCURDATA108_PIXEL271_LENGTH          0x00000004

#define _GLCDCURDATA108_PIXEL270_POSITION        0x0000001C
#define _GLCDCURDATA108_PIXEL270_MASK            0xF0000000
#define _GLCDCURDATA108_PIXEL270_LENGTH          0x00000004

#define _GLCDCURDATA109_PIXEL2715_POSITION       0x00000000
#define _GLCDCURDATA109_PIXEL2715_MASK           0x0000000F
#define _GLCDCURDATA109_PIXEL2715_LENGTH         0x00000004

#define _GLCDCURDATA109_PIXEL2714_POSITION       0x00000004
#define _GLCDCURDATA109_PIXEL2714_MASK           0x000000F0
#define _GLCDCURDATA109_PIXEL2714_LENGTH         0x00000004

#define _GLCDCURDATA109_PIXEL2713_POSITION       0x00000008
#define _GLCDCURDATA109_PIXEL2713_MASK           0x00000F00
#define _GLCDCURDATA109_PIXEL2713_LENGTH         0x00000004

#define _GLCDCURDATA109_PIXEL2712_POSITION       0x0000000C
#define _GLCDCURDATA109_PIXEL2712_MASK           0x0000F000
#define _GLCDCURDATA109_PIXEL2712_LENGTH         0x00000004

#define _GLCDCURDATA109_PIXEL2711_POSITION       0x00000010
#define _GLCDCURDATA109_PIXEL2711_MASK           0x000F0000
#define _GLCDCURDATA109_PIXEL2711_LENGTH         0x00000004

#define _GLCDCURDATA109_PIXEL2710_POSITION       0x00000014
#define _GLCDCURDATA109_PIXEL2710_MASK           0x00F00000
#define _GLCDCURDATA109_PIXEL2710_LENGTH         0x00000004

#define _GLCDCURDATA109_PIXEL279_POSITION        0x00000018
#define _GLCDCURDATA109_PIXEL279_MASK            0x0F000000
#define _GLCDCURDATA109_PIXEL279_LENGTH          0x00000004

#define _GLCDCURDATA109_PIXEL278_POSITION        0x0000001C
#define _GLCDCURDATA109_PIXEL278_MASK            0xF0000000
#define _GLCDCURDATA109_PIXEL278_LENGTH          0x00000004

